Autodesk.Revit.DB.FamilyPlacementType
The type of placement required for a given family.
Since:
2013

Autodesk.Revit.DB.FamilyPlacementType.Invalid
This signals an invalid value for the enum.

Autodesk.Revit.DB.FamilyPlacementType.Adaptive
The family is an adaptive family.

Autodesk.Revit.DB.FamilyPlacementType.CurveDrivenStructural
The family is a structural curve driven member (beam, brace, or slanted column)

Autodesk.Revit.DB.FamilyPlacementType.CurveBasedDetail
The family is based on a line and place on a specific view (e.g. a detail component).

Autodesk.Revit.DB.FamilyPlacementType.CurveBased
The family is based on a line and placed on a work plane.

Autodesk.Revit.DB.FamilyPlacementType.WorkPlaneBased
The family is placed on a work plane or face.

Autodesk.Revit.DB.FamilyPlacementType.ViewBased
The family is view-specific (e.g. a detail annotation)

Autodesk.Revit.DB.FamilyPlacementType.TwoLevelsBased
The family is placed referencing two levels (e.g. a column).

Autodesk.Revit.DB.FamilyPlacementType.OneLevelBasedHosted
The family is placed referencing a single level and host.

Autodesk.Revit.DB.FamilyPlacementType.OneLevelBased
The family is placed referencing a single level.